{
    "hoa hồng": {
        "scientific_name": "Rosa sp.",
        "description": "Vẻ đẹp kiêu sa với hương thơm dịu nhẹ, rất hợp với khí hậu Đà Lạt.",
        "origin": "Bắc Mỹ, Châu Âu và Tây Bắc Phi.",
        "characteristics": "Cây thân gỗ bụi thấp, cành có gai sắc. Lá kép lông chim, mép có răng cưa. Hoa có nhiều lớp cánh xếp xoắn ốc tuyệt đẹp.",
        "variety": "Hồng cổ Sapa",
        "soil": "Cần giá thể tơi xốp, giàu dinh dưỡng, pH 6.0-6.5. Trộn đất thịt, trấu hun, phân trùn quế và đá perlite.",
        "planting_tech": "Trồng nơi thoáng gió để hạn chế nấm bệnh. Cắt tỉa cành tăm, cành điếc sau mỗi lứa hoa để kích thích mầm mới.",
        "care_water": "Tưới đẫm vào gốc lúc sáng sớm (6 đến 7 giờ). Tuyệt đối không tưới đêm gây nấm lá. Mùa hè tưới 2 lần 1 ngày.",
        "care_light": "Cây ưa nắng trực tiếp, tối thiểu 6 đến 8 giờ 1 ngày. Thiếu nắng cây sẽ không ra hoa hoặc hoa nhỏ, nhạt màu.",
        "fertilizer": "Bón định kỳ 7 đến 10 ngày 1 lần. Giai đoạn sinh trưởng dùng NPK 30-10-10, giai đoạn đóng nụ dùng 6-30-30 hoặc 15-30-15.",
        "pests": "Bọ trĩ (làm xoăn lá), Nhện đỏ (làm bạc lá), Nấm phấn trắng. Phòng trừ bằng dầu Neem hoặc chế phẩm sinh học.",
        "fun_fact": "Hoa hồng là loài hoa đầu tiên được trồng trong không gian (năm 2002).",
        "folklore": "Trong thần thoại Hy Lạp, hoa hồng đỏ được sinh ra từ máu của nàng Aphrodite khi nàng chạy đi cứu người yêu Adonis."
    },
    "cúc": {
        "scientific_name": "Chrysanthemum morifolium",
        "description": "Loài hoa bền bỉ, mang lại cảm giác ấm cúng và phúc lộc.",
        "origin": "Đông Á (Trung Quốc, Nhật Bản).",
        "characteristics": "Thân thảo, mọc đứng. Lá xẻ thùy chân vịt. Hoa dạng cụm đầu, đa dạng màu sắc (vàng, trắng, tím...).",
        "variety": "Cúc Đại Đóa",
        "soil": "Đất thịt nhẹ, pH 6.0-7.0. Luống trồng cao để thoát nước tốt.",
        "planting_tech": "Nhân giống chủ yếu bằng giâm cành. Kỹ thuật bấm ngọn (pinching) giúp cây phân nhiều nhánh và nhiều hoa.",
        "care_water": "Ưa ẩm nhưng sợ úng. Tưới nhỏ giọt hoặc phun mưa nhẹ 1 lần/ngày. Giữ độ ẩm đất 70-80%.",
        "care_light": "Cây ngày ngắn. Để kích thích ra hoa cần che tối (xử lý quang chu kỳ) hoặc thắp đèn để ngăn ra hoa sớm.",
        "fertilizer": "Ưa phân hữu cơ hoai mục. Bón Kali cao giai đoạn nụ để hoa bền màu, cứng cuống.",
        "pests": "Rệp muội, Sâu vẽ bùa, Bệnh rỉ sắt.",
        "fun_fact": "Trà hoa cúc đã được sử dụng như một phương thuốc từ thời nhà Tống (Trung Quốc) để hạ hỏa và sáng mắt.",
        "folklore": "Ở Nhật Bản, hoa cúc là biểu tượng của Hoàng gia và sự trường tồn. Lễ hội hoa cúc được tổ chức hàng năm vào ngày 9 tháng 9."
    },
    "xương rồng": {
        "scientific_name": "Cactaceae",
        "description": "Vẻ đẹp gai góc nhưng đầy sức sống mãnh liệt.",
        "origin": "Châu Mỹ, chủ yếu vùng sa mạc.",
        "characteristics": "Thân mọng nước dự trữ dinh dưỡng. Lá tiêu biến thành gai để hạn chế thoát hơi nước.",
        "variety": "Xương rồng Kim Hổ",
        "soil": "Yêu cầu thoát nước cực tốt. Giá thể gồm: Xỉ than, Đá Pumice, Perlite, Phân trùn quế (tỷ lệ đá > 50%).",
        "planting_tech": "Có thể gieo hạt hoặc giâm nhánh. Khi trồng không nên lấp đất quá sâu che mất cổ rễ.",
        "care_water": "Nguyên tắc: Đất khô hẳn mới tưới. Tưới đẫm một lần rồi để khô. Mùa đông có thể cắt nước hoàn toàn.",
        "care_light": "Cần nắng trực tiếp cả ngày. Nếu để trong nhà, cây sẽ bị 'vống' (mọc dài, yếu ớt) và mất màu.",
        "fertilizer": "Dùng phân tan chậm chuyên dụng (Osmocote) 6 tháng/lần.",
        "pests": "Rệp sáp (trắng như bông) bám ở kẽ gai hoặc rễ. Dùng cồn y tế hoặc thuốc tím để trị.",
        "fun_fact": "Xương rồng Saguaro khổng lồ có thể sống tới 150-200 năm và cao tới 12 mét.",
        "folklore": "Người Aztec tin rằng thần Huitzilopochtli đã chỉ cho họ nơi xây dựng thành phố (Mexico City ngày nay) tại nơi có con đại bàng đậu trên cây xương rồng."
    },
    "hướng dương": {
        "scientific_name": "Helianthus annuus",
        "description": "Loài hoa rực rỡ luôn hướng về ánh nằng mặt trời.",
        "origin": "Bắc Mỹ.",
        "characteristics": "Thân to, có lông cứng. Hoa tự dạng đầu lớn, cánh hoa màu vàng rực xếp xung quanh đĩa hoa nâu sẫm.",
        "variety": "Hướng dương Sakata Nhật Bản",
        "soil": "Đất phù sa, tơi xốp, giàu dinh dưỡng. Rễ hướng dương ăn sâu và rộng.",
        "planting_tech": "Gieo hạt trực tiếp vào hốc. Với giống cao cần cắm cọc đỡ để tránh đổ ngã khi ra hoa.",
        "care_water": "Nhu cầu nước rất lớn giai đoạn sinh trưởng. Tưới 1-2 lần/ngày. Thiếu nước lá sẽ héo rũ rất nhanh.",
        "care_light": "Bắt buộc phải có nắng toàn phần (Full Sun). Cây hướng về phía có ánh sáng mạnh nhất.",
        "fertilizer": "Bón lót phân chuồng thật kỹ. Bón thúc đạm khi cây con và NPK cân đối khi ra hoa.",
        "pests": "Sâu ăn lá, Nấm đốm lá (Alternaria).",
        "fun_fact": "Một bông hoa hướng dương thực chất là tập hợp của 1.000-2.000 bông hoa nhỏ li ti xếp chồng lên nhau.",
        "folklore": "Theo thần thoại Hy Lạp, nàng tiên cá Clytie vì yêu đơn phương thần Mặt Trời Apollo nên đã hóa thân thành hoa hướng dương để mãi mãi dõi theo chàng."
    },
    "lan": {
        "scientific_name": "Orchidaceae",
        "description": "Nữ hoàng của các loài hoa nhiệt đới với vẻ đẹp sang trọng.",
        "origin": "Phân bố toàn cầu, đa dạng nhất ở rừng nhiệt đới.",
        "characteristics": "Cây phụ sinh hoặc địa lan. Hoa có cấu trúc đối xứng lưỡng trắc, cánh môi đặc sắc.",
        "variety": "Lan Hồ Điệp Mãn Thiên Hồng",
        "soil": "Không dùng đất thường. Giá thể phải cực thoáng: Vỏ thông, Than củi, Dớn, Viên đất nung.",
        "planting_tech": "Trồng chậu nhiều lỗ hoặc ghép gỗ. Quan trọng là bộ rễ phải thoáng khí, không bị bí.",
        "care_water": "Tưới phun sương vào sáng sớm. Không tưới vào ngọn (nõn) lan gây thối nhũn. Quy tắc: 'Ướt - Khô' xen kẽ.",
        "care_light": "Ưa ánh sáng tán xạ (qua lưới che 50-60%). Nắng gắt trực tiếp sẽ làm cháy lá (bỏng lá).",
        "fertilizer": "Lan ăn phân qua lá tốt hơn rễ. Phun NPK liều lượng loãng 1/2 so với chỉ dẫn, định kỳ hàng tuần.",
        "pests": "Nhện đỏ, Ốc sên ăn rễ, Bệnh thối nhũn (Erwinia).",
        "fun_fact": "Vani (Vanilla) mà chúng ta ăn thực chất là quả của một loài hoa lan dây leo.",
        "folklore": "Charles Darwin đã từng nghiên cứu say mê một loài lan có cựa dài 30cm và dự đoán phải có loài bướm có vòi dài tương ứng thụ phấn cho nó. 21 năm sau, loài bướm đó mới được tìm thấy."
    },
    "tulip": {
        "scientific_name": "Tulipa",
        "description": "Vẻ đẹp hoàn hảo và màu sắc rực rỡ, biểu tượng của Hà Lan.",
        "origin": "Trung Á (Sườn núi Himalaya), Thổ Nhĩ Kỳ.",
        "characteristics": "Cây thân thảo mọc từ củ (bulb). Hoa hình chuông hoặc hình chén, mọc đơn lẻ trên đỉnh.",
        "variety": "Tulip Đỏ Hà Lan",
        "soil": "Giá thể sạch, thoát nước tốt (Mùn dừa, Peat moss). Đất bí dễ làm thối củ.",
        "planting_tech": "Cần xử lý lạnh củ (Vernalization) ở 5 độ C trước khi trồng để phá ngủ. Trồng củ sâu 2/3 vào đất.",
        "care_water": "Tưới vừa đủ ẩm. Tuyệt đối không để đọng nước ở đĩa lót chậu.",
        "care_light": "Ưa sáng nhẹ, khí hậu mát mẻ (15-20 độ C). Nhiệt độ cao hoa sẽ tàn rất nhanh.",
        "fertilizer": "Củ mẹ đã dự trữ đủ dinh dưỡng. Chỉ cần tưới thêm Canxi, Kali vi lượng để hoa cứng cáp.",
        "pests": "Nấm mốc xanh (Penicillium) trên củ.",
        "fun_fact": "Hoa Tulip có thể tiếp tục cao thêm 2-3cm ngay cả khi đã bị cắt khỏi cây và cắm vào bình.",
        "folklore": "Vào thế kỷ 17 tại Hà Lan, cơn sốt Tulip (Tulip Mania) đã khiến giá một củ hoa Tulip tương đương với một ngôi nhà, tạo nên bong bóng kinh tế đầu tiên trong lịch sử."
    },
    "ly": {
        "scientific_name": "Lilium",
        "description": "Sự thanh khiết và quý phái với hương thơm nồng nàn.",
        "origin": "Ôn đới Bắc Bán cầu.",
        "characteristics": "Cây thân thảo từ củ vảy. Hoa loa kèn lớn, 6 cánh, nhị dài.",
        "variety": "Ly Ù Vàng Concador",
        "soil": "Đất tơi xốp, nhiều mùn, pH 5.5-6.5. Mùn dừa và đất tribat là lựa chọn tốt.",
        "planting_tech": "Lấp đất sâu 10-15cm để cây ra 'rễ thân' (rễ mọc trên củ) giúp hút dinh dưỡng chính.",
        "care_water": "Giữ ẩm đất thường xuyên. Tránh tưới lên hoa làm trôi phấn và nát cánh.",
        "care_light": "Giai đoạn đầu cần che tối. Khi cây cao 20cm đưa ra sáng. Tránh nắng gắt buổi trưa.",
        "fertilizer": "Ly phàm ăn. Bón NPK đầu trâu định kỳ. Bổ sung Vi lượng để lá xanh, hoa đậm.",
        "pests": "Rệp sáp, Bệnh cháy bìa lá (Leaf Scorch) do thiếu Canxi.",
        "fun_fact": "Mèo cực kỳ nhạy cảm với phấn hoa Ly. Chỉ một lượng nhỏ cũng có thể gây suy thận cấp cho mèo.",
        "folklore": "Trong Kitô giáo, hoa ly trắng (Madonna Lily) là biểu tượng của Đức Mẹ Đồng Trinh, tượng trưng cho sự thuần khiết và đức hạnh."
    },
    "cẩm tú cầu": {
        "scientific_name": "Hydrangea macrophylla",
        "description": "Những quả cầu hoa rực rỡ có khả năng đổi màu kỳ diệu.",
        "origin": "Đông Á (Nhật Bản, Hàn Quốc).",
        "characteristics": "Cây bụi rụng lá. Cụm hoa hình cầu lớn gồm nhiều hoa nhỏ. Lá to, mép răng cưa.",
        "variety": "Cẩm tú cầu Vô Tận (Endless Summer)",
        "soil": "Đất giàu mùn, ẩm ướt nhưng không úng.",
        "planting_tech": "Điều chỉnh màu hoa: Đất chua (pH < 5.5) + Nhôm -> Hoa Xanh Lam. Đất kiềm (pH > 6.5) -> Hoa Hồng/Đỏ.",
        "care_water": "Tên 'Hydra' nghĩa là nước. Cây rất khát nước. Lá héo rũ ngay nếu quên tưới 1 ngày.",
        "care_light": "Ưa bóng râm một phần (nắng sáng, chiều mát). Không chịu được nắng gắt trực tiếp.",
        "fertilizer": "Dùng Nhôm Sulfat để giữ màu xanh. Dùng Vôi bột để chuyển màu hồng.",
        "pests": "Bệnh phấn trắng, rệp.",
        "fun_fact": "Màu sắc của hoa không phải do sắc tố cố định mà do nồng độ ion Nhôm trong đất quyết định.",
        "folklore": "Ở Nhật Bản, truyền thuyết kể rằng một vị hoàng đế đã tặng hoa cẩm tú cầu cho gia đình người con gái ông yêu để xin lỗi vì đã dành quá nhiều thời gian cho công việc."
    },
    "sen đá": {
        "scientific_name": "Succulents (Echeveria sp.)",
        "description": "Loài thực vật nhỏ bé nhưng vô cùng kiên cường.",
        "origin": "Vùng bán sa mạc khô hạn.",
        "characteristics": "Lá mọng nước xếp thành vòng (rosette) giống bông hoa. Màu sắc thay đổi theo nắng và nhiệt độ (hiện tượng lên màu).",
        "variety": "Sen đá Phật Bà",
        "soil": "Giá thể phải thật tơi xốp, mau khô. Công thức chuẩn: Đá Pumice/Perlite (70%) + Peat moss/Trùn quế (30%).",
        "planting_tech": "Nhân giống dễ dàng bằng cách tách lá (leaf propagation). Đặt lá lên mặt đất ẩm, cây con sẽ mọc ra từ gốc lá.",
        "care_water": "Tưới thấm ngược (đặt chậu vào khay nước) để không đọng nước ở kẽ lá gây thối. 1 tuần/lần.",
        "care_light": "Cần nhiều nắng, thoáng gió, chênh lệch nhiệt độ ngày đêm lớn để cây 'lên màu' đẹp.",
        "fertilizer": "Rất ít. 1 năm chỉ cần vài viên phân tan chậm.",
        "pests": "Rệp sáp trắng, Nấm đen.",
        "fun_fact": "Nếu bạn lỡ tay làm gãy một chiếc lá, đừng vứt đi. Chiếc lá đó là khởi đầu cho một mầm sống mới.",
        "folklore": "Sen đá được xem là biểu tượng của tình yêu bền vững, trọn đời không thay đổi vì sức sống mãnh liệt của nó ngay cả trong sỏi đá."
    }
}